#### ScheduleSortOrder Enumeration

---

|  |
| --- |
| See Also |

Options for sort order of rows in a schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ScheduleSortOrder ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ScheduleSortOrder ``` |

| Visual C++ |
| --- |
| ``` public enum class ScheduleSortOrder ``` |

# Members

| Member name | Description |
| --- | --- |
| Ascending | Sort in ascending order. |
| Descending | Sort in descending order. |

# See Also

Autodesk.Revit.DB Namespace